# SetOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeType..::..SetOptions Method
DirectShapeType Class See Also
---
Sets the options to use for this DirectShapeType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public void SetOptions(
	DirectShapeTypeOptions options
)
```

Visual Basic
---
```text
Public Sub SetOptions ( _
	options As DirectShapeTypeOptions _
)
```

Visual C++
---
```text
public:
void SetOptions(
	DirectShapeTypeOptions^ options
)
```

# ### Parameters
options
    Type: Autodesk.Revit.DB..::..DirectShapeTypeOptions Options to use for this DirectShapeType.
# Remarks
The new options take effect immediately.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The DirectShapeTypeOptions provided are not valid for this DirectShapeType. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace